{
  "title": "Abie's Website",
  "title2": "ABIE'S WEBSITE",
  "Tab-AboutMe": "About Me",
  "Tab-Work": "My Work",
  "Tab-Media": "Social Media",
  "Tab-Projects": "Projects",
  "Tab-Secret": "Cuties",
  "MP-TextTop": "Welcome",
  "MP-TextSub": "Feel free to look at the pages below to learn more about my work and also learn about myself and how to contact me!",
  "Button-AboutMe": "About Me",
  "Button-Contact": "Contact Me",
  "AboutMe-Title": "ABOUT ME",
  "AboutMe-Sub": "Below, you will find information about me.",
  "AboutMe-T1": "Let me present myself. My name is A. GUERRAZ but all my friends call me Abie. I was born the 03/10/2004  in Annecy, in High-Savoy.",
  "AboutMe-T2": "I'm currently on the look for a job, and staying in Albertville, France.",
  "AboutMe-T3": "I have lots of experience in graphic design and coding, and I wish to be able to work in these domains.",
  "AboutMe-Spoiler": "I identify as a trans woman, and I would like to be called by the name 'Abie' and the pronouns 'she/her'.",
  "School-Title": "MY EDUCATION AND TRAINING",
  "School-Sub": "Information on my Education and where I have done my training.",
  "School-T1": "I have studied at the LPO René Perrin in Ugine, where I have obtained my Bachelor's degree in Sciences and Technologies for Industry and Sustainable Development.",
  "School-T2": "I then did a year and a half of online studying in a BTEC IT Services for Organizations, Infrastructure, Systems and Network Solutions with the CNED, an online school.",
  "School-T3": "Alongside these two, I have obtained a Cambridge Assessment English certificate, with Merit.",
  "School-T4": "I also have done an internship with Bureau Veritas Exploitation, a company that specifies in risk management and other solutions.",
  "Pills-SchoolTab": "School",
  "Pills-WorkTab": "Work",
  "Pills-JobSearchTab": "Job Search",
  "Pills-ExperienceTab": "Experience",
  "Pills-School-Title": "School Projects",
  "Pills-School-Desc": "At school, I have been working on various things but mostly, my projects have consisted of working on robots like a vacuum, which would detect objects in its way and avoid them in order to clean more efficiently.",
  "Pills-School-Desc2": "My latest project involves trying to make a smart tablet that you can use on your wrist, using a Raspberry Pi 3B+ and 3D printed assets.",
  "Pills-Work-Title": "My Work",
  "Pills-Work-Desc": "For a while, I worked in Freelance as a graphic designer, front-end web developer, and very rarely a 3D modeller.",
  "Pills-Work-Desc2": "I have done a lot of banners, profile pictures and just websites for people in my entourage who needed the help, and also for companies.",
  "Pills-JSearch-Title": "My Job Search",
  "Pills-JSearch-Desc": "Currently, I'm looking for a job so I can have a stable income and figure out a place to flourish.",
  "Pills-JSearch-Desc2": "As of the 9th of April, 2025, I am still actively looking for a job, and sending CVs.",
  "Pills-Experience-Title": "My Experience",
  "Pills-Experience-Desc": "I have a lot of experience in some of the most popular languages, like C++, HTML, CSS, Lua, Python 3+, JavaScript, json and more recently, Cura.",
  "Pills-Experience-Desc2": "I also have a lot of experience when it comes to  using software used by big companies, like Photoshop or even Visual Code, although I am now using PhpStorm.",
  "Work-Title": "MY WORK",
  "Work-Sub": "These are the languages / software I use",
  "Work-Sub1": "SECURITY",
  "Work-Desc1": "NordVPN, ExpressVPN, Raspberry Pi 3B loaded with Kali's ARM version.",
  "Work-Sub2": "SOFTWARE",
  "Work-Desc2": "Unity, Blender, Solidworks, paint.net, Photoshop 2020, Visual Studio Code, VRoid, Cura, Atom, PhpStorm, ChatGPT.",
  "Work-Sub3": "LANGUAGES",
  "Work-Desc3": "English (C2), French (C2)",
  "Work-Sub4": "CODING",
  "Work-Desc4": "C++, HTML, CSS, Lua, Python 3+, JavaScript, json",
  "Experience-Title": "What I would like to do in the future",
  "Experience-Sub": "In the future, there's a lot of things I want to do. But I think most importantly, I would want to do :",
  "Experience-Sub1": "Cybersecurity",
  "Experience-Desc1": "I really want to work in cyber-security and make the Net more secure as well as prevent accidents like accidental virus downloads.",
  "Experience-Sub2": "Information Technology",
  "Experience-Desc2": "I could also work in an IT department due to my prior knowledge of how to use remote connections and how to fix various issues on computers.",
  "Experience-Sub3": "Graphic Design / Webdev",
  "Experience-Desc3": "Due to my current experience, I think I would be a good fit for any graphic design jobs.",
  "Media-Title": "MY SOCIAL MEDIA",
  "Media-Sub": "Here are my most used social media. You can use these to contact me and also ask me questions.",
  "Media-Desc1": "Using this to make my websites, plugins!",
  "Media-Desc2": "Using this for basic contact.",
  "Media-Desc3": "Using this for professional contact.",
  "Media-Desc4": "My LinkedIn.",
  "Review-Title": "REVIEWS ON ME AND MY WORK",
  "Review-Sub": "Here are some reviews from people who know me / have used my online services.",
  "Review-1": "Abie is a capable and efficient programmer. As a long-time partner for all class projects of the TSTI2 class, I never worried about the script due to their knowledge in any kind of task : C++, HTML, JavaScript and many others.",
  "Review-1-Name": "Classmate",
  "Review-2": "A. GUERRAZ is a quiet student, able to invest themselves in projects that they are passionate about, they are always listening to their peers.",
  "Review-2-Name": "Teacher (SIN)",
  "Review-3": "\"Abie is a dedicated worker and delivers work always on schedule. They have no problem with coordinating themselves and following the instructions they are given.\"",
  "Review-4": "\"I've known Abie for two years now and have worked with them daily. I oversee many projects they accomplish, and I can say without a doubt that not only are they an amazing individual, but that they present outstanding work.\"",
  "Review-4-Name": "Acquaintance, Friend",
  "Review-5": "\"Abie followed up with me constantly regarding the project and carried it well, taking critiques and following standards to produce clean code and a beautiful design.\"",
  "Thanks-Title": "THANK YOU",
  "Thanks-Sub": "Please also take a look at some of my work on the projects page.",
  "Thanks-Desc": "Projects",
  "title3": "PROJECTS",
  "Tab-Vacuum": "Vacuum Robot",
  "Tab-Local": "Local Secure",
  "Tab-Other": "Other Projects",
  "Tab-Index": "Index",
  "MP-TextTop-P": "PROJECTS",
  "MP-TextTop2": "Here are my projects.",
  "MP-TextSub2": "Below, you will be able to see my current project and past projects in school, and simply, class with the help of my classmates.",
  "Button-Scroll": "YEETBA V1",
  "Button-Scroll2": "LOCAL SECURE",
  "Vacuum-Title": "THE YEETBA V1",
  "Vacuum-Sub": "Also known as a vacuum robot,",
  "Vacuum-Desc1": "The YEETBA V1 is a simple vacuum robot made to work efficiently along a user-specified area that can be defined inside the app itself.",
  "Vacuum-Desc2": "At first, we had multiple ideas for the bot, such as making it as a military defense bot, a vacuum robot (our current idea), and also a cooking bot.",
  "Vacuum-Desc3": "Below, you will find images of our code and the robot itself.",
  "Explanation-Title": "HOW WE CODED THE ROBOT",
  "Explanation-Sub": "This includes codes made in C++ during class time.",
  "Explanation-1": "The test bench for the bot",
  "Explanation-2": "The inclusion code for the bot",
  "Explanation-3": "The initialisation code for the bot",
  "Explanation-4": "The setup code for the bot",
  "Explanation-5": "The looping code for the Wiimote",
  "Explanation-6": "The looping code for the IR remote",
  "Explanation-7": "The functions used to move the bot",
  "Explanation-Title2": "CODE EXPLANATION",
  "Explanation-Sub2": "Below, I will explain the code for this project.",
  "Explanation-Desc1": "The bot is coded in C++, through the use of an Arduino MegaADK and two motors, as well as a 12V battery and a bluetooth USB and an IR receiver.",
  "Explanation-Desc2": "The code above allows us to make the bot move simply by using either a Wiimote connected through Bluetooth, or a infrared remote connected via the receiver.",
  "Explanation-Desc3": "The code first includes libraries then sets them up, allowing us to use the motors's directions and power width modulation pins as an output. We can then use this to move the bot forwards, backwards, left, right and make it stop.",
  "Local-Title": "THE LOCAL SECURE PROJECT",
  "Local-Sub": "This project is made as a new type of handle to make your house or supply rooms more safe.",
  "Local-Desc1": "This project is a handle that fits on any type of door.",
  "Local-Desc2": "It uses a RFID chip scanner, a keypad and a camera to keep yourself and what you own safe. You can control the handle and everything from a dedicated website and app.",
  "Local-Desc3": "Below, you will find images regarding the Local Secure Project.",
  "Explanation-Title3": "WHAT WE HAVE WORKED ON",
  "Explanation-Sub3": "This includes diagrams and codes made in C++ during class time.",
  "Explanation-8": "Data Planning for what to use",
  "Explanation-9": "Gantt Diagram",
  "Explanation-10": "The code for the Keypad",
  "Explanation-11": "The terms of reference",
  "Explanation-Title4": "EXPLANATION",
  "Explanation-Sub4": "Below, I will explain the project in further depth.",
  "Explanation-Desc4": "The door uses two cards primarily, a Raspberry Pi 3B+ loaded with Ubuntu's ARM Server version, as well as it's Lubuntu based graphics display.",
  "Explanation-Desc5": "It also uses an Arduino MegaADK with a RFID scanning board and a keypad which we made.",
  "Explanation-Desc6": "The Raspberry Pi will allow us to create a web server and host it. This will allow the user to use the website in order to log in to their profile to use the door.",
  "Other-Title": "OTHER PROJECTS",
  "Other-Sub": "This part is to show the other projects I have done throughout my school years.",
  "Other-Desc1": "During my school years, I have done some projects, per example,",
  "Other-Desc2": "I had to make it so an LCD screen could work with an Arduino card and show a specific message related to a power width modulator. For another example,",
  "Other-Desc3": "I worked on a inter-connected messaging system with multiple Raspberry Pi devices connected to the same network, where people could use usernames along with their IP to send messages to each other.",
  "Home-Title": "PROJECTS DONE AT HOME",
  "Home-Sub": "There are also a lot of projects I've done at home, like :",
  "Home-Desc1": "I worked on my own Raspberry Pi 3B, which uses Kali. I use it to make sure my network is secure and also to check if it is possible to attack it.",
  "Home-Desc2": "I also have worked on graphic design and web design commissions, although I've stopped doing so.",
  "Home-Desc3": "More recently, I have acquired a 3D printer and am using it to make my projects be done faster, by doing the modelling work myself."
}