{
  "fr": {
    "title": "Le site d'Abie",
    "title2": "LE SITE D'ABIE",
    "Tab-AboutMe": "Mes Informations",
    "Tab-Work": "Mon Travail",
    "Tab-Media": "Médias Sociaux",
    "Tab-Projects": "Projets",
    "MP-TextTop": "Bienvenue",
    "MP-TextSub": "N'hésitez pas à consulter les pages ci-dessous pour en savoir plus sur mon travail et apprendre également à me connaître et à me contacter.",
    "Button-AboutMe": "Mes Informations",
    "Button-Contact": "Contactez-moi",
    "AboutMe-Title": "MES INFORMATIONS",
    "AboutMe-Sub": "Ci-dessous, vous allez trouver des informations sur moi.",
    "AboutMe-T1": " Je me présente. Mon nom est A. GUERRAZ mais tous mes amis m'appelle Abie. Je suis née le 03/10/2004 à Annecy en Haute-Savoie.",
    "AboutMe-T2": " J'étudie en ce moment au Lycée René Perrin à Ugine, et j'habite à Albertville.",
    "AboutMe-T3": " J'ai beaucoup de compétences en design graphique et en programmation et j'aimerai beaucoup travailler dans ces domaines.",
    "AboutMe-Spoiler": "J'identifie en tant que femme trans et je souhaite utiliser le prénom Abie et les pronoms féminin.",
    "Pills-SchoolTab": "École",
    "Pills-WorkTab": "Travail",
    "Pills-ExperienceTab": "Expériences",
    "Pills-School-Title": "Projets Scolaires",
    "Pills-School-Desc": "À l'école, j'ai travaillée sur différentes choses, mais la plupart du temps, mes projets consistaient à travailler sur des robots, comme un aspirateur, qui détectait les objets sur son chemin et les évitait afin de nettoyer plus efficacement.",
    "Pills-School-Desc2": "Mon dernier projet consiste à travailler sur une serrure intelligente qui utilisera un code HEX à 6 chiffres ou un scanner d'empreintes digitales pour déverrouiller la porte et pouvoir l'ouvrir.",
    "Pills-Work-Title": "Mon Travail",
    "Pills-Work-Desc": "En ligne, je travaille seul dans la conception graphique, le développement web et le codage en général !",
    "Pills-Work-Desc2": "J'ai fait beaucoup de bannières, de photos de profil et de sites web pour des personnes de mon entourage qui avaient besoin d'aide.",
    "Pills-Experience-Title": "Mes Expériences",
    "Pills-Experience-Desc": "J'ai beaucoup d'expériences dans plusieurs langues des plus populaires, comme Lua, Python, HTML, CSS, C++.",
    "Pills-Experience-Desc2": "J'ai également beaucoup d'expériences dans l'utilisation de logiciels utilisés par les grandes entreprises, comme Photoshop ou même Visual Code.",
    "Work-Title": "MON TRAVAIL",
    "Work-Sub": "Voici les langues / logiciels que je pratique",
    "Work-Sub1": "SÉCURITÉ",
    "Work-Desc1": "NordVPN, ExpressVPN, Raspberry Pi 3B chargé avec la version ARM de Kali.",
    "Work-Sub2": "SOFTWARE",
    "Work-Desc2": "Unity, Blender, Solidworks, paint.net, Photoshop 2020, Visual Studio Code, VRoid",
    "Work-Sub3": "LANGUES",
    "Work-Desc3": "Anglais, Français",
    "Work-Sub4": "PROGRAMMATION",
    "Work-Desc4": "C++, HTML, CSS, Lua, Python 3+, JavaScript, json",
    "Experience-Title": "Ce que j'aimerais faire à l'avenir",
    "Experience-Sub": "Dans le futur, il y a beaucoup de choses que je veux faire. Mais je pense que le plus important, je voudrais faire :",
    "Experience-Sub1": "Cybersécurité",
    "Experience-Desc1": "J'aimerai travailler dans le domaine de la cybersécurité et rendre le Net plus sûr, ainsi que prévenir les accidents comme les téléchargements accidentels de virus.",
    "Experience-Sub2": "Technologies de l'Information",
    "Experience-Desc2": "Je pourrai également travailler dans un service informatique en raison de mes connaissances préalables sur l'utilisation des connexions à distance et la résolution de divers problèmes informatiques.",
    "Experience-Sub3": "Design Graphique / Webdev",
    "Experience-Desc3": "En raison de mon expérience actuelle, je pense que je serai un bon candidat dans le domaine de la conception graphique.",
    "Media-Title": "MES CONTACTS / RÉSEAUX SOCIAUX",
    "Media-Sub": "Voici mes médias sociaux les plus utilisés. Vous pouvez les utiliser pour me contacter et aussi pour me poser des questions.",
    "Media-Desc1": "Utilisé pour créer des sites web et plugins!",
    "Media-Desc2": "Je l'utilise pour un contact de base.",
    "Media-Desc3": "Je l'utilise pour des contacts professionnels.",
    "Review-Title": "AVIS SUR MON TRAVAIL",
    "Review-Sub": "Voici quelques commentaires de personnes qui me connaissent / ont utilisé mes services en ligne.",
    "Review-1": "Abie est une programmeuse compétente et efficace. En tant que partenaire de longue date pour tous les projets de la classe TSTI2, je ne me suis jamais inquiété du programme en raison de ses connaissances dans tout type de tâches : C++, HTML, JavaScript et bien d'autres.",
    "Review-1-Name": "Camarade",
    "Review-2": "Angel est un élève discrète, capable de s'investir dans des projets qui le passionnent, toujours à l'écoute de ses camarades.",
    "Review-2-Name": "Professeur (SIN)",
    "Review-3": "\"Abie, est une travailleuse dévouée et livre le travail toujours dans les délais. Elle n'a aucun problème à se coordonner et à suivre les instructions qui lui sont données.\"",
    "Review-4": "\"Je connais Abie depuis deux ans maintenant et je travaille avec elle quotidiennement. Je supervise de nombreux projets qu'elle a réalisée et je peux dire sans l'ombre d'un doute que non seulement elle est une personne extraordinaire, mais qu'elle présente un travail remarquable.\"",
    "Review-4-Name": "Mon Manager, Petit Ami",
    "Review-5": "\"Abie a souvent consulté avec moi au sujet du projet et l'a mené à bien, acceptant les critiques et suivant les normes pour produire un code propre et un beau design.\"",
    "Thanks-Title": "MERCI",
    "Thanks-Sub": "Renseignez-vous sur mes travaux dans la page des projets.",
    "Thanks-Desc": "Projets",
    "title3": "PROJETS",
    "Tab-Vacuum": "Robot Aspirateur",
    "Tab-Local": "Local Sécurisé",
    "Tab-Other": "Autre Projets",
    "Tab-Index": "Index",
    "MP-TextTop-P": "PROJETS",
    "MP-TextTop2": "Voici mes projets",
    "MP-TextSub2": " Ci-dessous, vous pourrez voir mon projet actuel et mes projets fait à l'école, et simplement, en classe avec l'aide de mes camarades.",
    "Button-Scroll": "YEETBA V1",
    "Button-Scroll2": "LOCAL SÉCURISÉ",
    "Vacuum-Title": "LE YEETBA V1",
    "Vacuum-Sub": "Aussi connu sous le nom de robot aspirateur,",
    "Vacuum-Desc1": " Le YEETBA V1 est un robot aspirateur conçu pour travailler efficacement dans une zone spécifiée par l'utilisateur, qui peut être définie par l'application.",
    "Vacuum-Desc2": " Au début, nous avions plusieurs idées pour le robot, comme un robot de défense militaire, un robot aspirateur (notre idée actuelle), ou aussi un robot de cuisine.",
    "Vacuum-Desc3": " Vous trouverez ci-dessous des images de notre code et du robot.",
    "Explanation-Title": "COMMENT NOUS AVONS CODÉ LE ROBOT",
    "Explanation-Sub": "Cela inclut les codes réalisés en C++ pendant les cours.",
    "Explanation-1": "Le banc d'essai du robot",
    "Explanation-2": "Le code d'inclusion pour le bot",
    "Explanation-3": "Le code d'initialisation du robot",
    "Explanation-4": "Le code de configuration du robot",
    "Explanation-5": "Le code en boucle pour la Wiimote",
    "Explanation-6": "Le code de boucle pour la télécommande IR",
    "Explanation-7": "Les fonctions utilisées pour déplacer le robot",
    "Explanation-Title2": "EXPLICATION DU CODE",
    "Explanation-Sub2": "Ci-dessous, j'explique le code de ce projet.",
    "Explanation-Desc1": " Le robot est codé en C++, grâce à l'utilisation d'une Arduino MegaADK et de deux moteurs, ainsi que d'une batterie 12V et d'un récepteur USB bluetooth et IR.",
    "Explanation-Desc2": " Le code ci-dessus nous permets de déplacer le robot en utilisant soit une Wiimote connectée via Bluetooth, soit une télécommande infrarouge connectée via le récepteur.",
    "Explanation-Desc3": " Le code inclus les bibliothèques puis les configure, ce qui nous permet d'utiliser les directions du moteurs et les broches de modulation de largeur de puissance comme sortie. Nous pouvons, ensuite, les utiliser pour déplacer le robot en avant, en arrière, à gauche, à droite et le faire s'arrêter.",
    "Local-Title": "LE PROJET LOCAL SÉCURISÉ",
    "Local-Sub": "Ce projet est une poignée créée rendre votre maison ou vos locaux plus sûrs.",
    "Local-Desc1": " Ce projet est une poignée qui s'adapte à tout type de porte.",
    "Local-Desc2": " Il utilise un scanner de puces RFID, un clavier et une caméra pour assurer votre sécurité et celle de vos biens. Vous pouvez contrôler la poignée et tout le reste depuis un site web et une application dédiée.",
    "Local-Desc3": " Vous trouverez ci-dessous des images concernant le projet Local Sécurisé.",
    "Explanation-Title3": "CE SUR QUOI NOUS AVONS TRAVAILLÉ",
    "Explanation-Sub3": "Cela inclut les diagrammes et les codes réalisés en C++ pendant les cours.",
    "Explanation-8": "Planification des données pour savoir quoi utiliser",
    "Explanation-9": "Gantt Diagram",
    "Explanation-10": "Le code pour le clavier",
    "Explanation-11": "Le cahier des charges",
    "Explanation-Title4": "EXPLICATIONS",
    "Explanation-Sub4": "Ci-dessous, je vais expliquer le projet de manière plus approfondie.",
    "Explanation-Desc4": " La porte utilise principalement deux cartes, un Raspberry Pi 3B+ chargé de la version ARM Server d'Ubuntu, ainsi que son système graphique basé sur Lubuntu.",
    "Explanation-Desc5": " Il utilise également un Arduino MegaADK avec une carte de lecture RFID et un clavier que nous avons fabriqués.",
    "Explanation-Desc6": " Le Raspberry Pi nous permettra de créer un serveur web et de l'héberger. Cela permettra à l'utilisateur d'utiliser le site web afin de se connecter à son profil pour utiliser la porte.",
    "Other-Title": "AUTRES PROJETS",
    "Other-Sub": "Cette partie est destinée à montrer les autres projets que j'ai réalisés tout au long de ma scolarité.",
    "Other-Desc1": " Pendant mes années d'études, j'ai réalisé quelques projets, par exemple,",
    "Other-Desc2": " Je devais faire qu'un écran LCD puisse fonctionner avec une carte Arduino et afficher un message spécifique lié à un modulateur de largeur de puissance. Un autre exemple,",
    "Other-Desc3": " J'ai travaillée sur un système de messagerie interconnectée avec plusieurs appareils Raspberry Pi connectés au même réseau, où les gens peuvent utiliser des noms d'utilisateur avec leur adresse IP pour s'envoyer des messages.",
    "Home-Title": "PROJETS RÉALISÉS À LA MAISON",
    "Home-Sub": "Il y a aussi beaucoup de projets que j'ai réalisés à la maison, comme :",
    "Home-Desc1": " J'ai travaillée sur mon propre Raspberry Pi 3B, qui utilise Kali. Je l'utilise pour m'assurer que mon réseau est sécurisé et aussi pour vérifier s'il est possible de l'attaquer.",
    "Home-Desc2": " J'ai également travaillée sur des commandes de conception graphique et de conception de sites web, bien que j'aie cessé de le faire."
  }
}